src/test/resources/org/lockss/ws/status/queryAusRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/DaemonStatusService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://status.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:queryAus>
            <auQuery>select auId, name</auQuery>
        </service:queryAus>
    </soapenv:Body>
</soapenv:Envelope>
